In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic_train = pd.read_csv(r"C:\Users\avira\OneDrive\Desktop\Aviral - ml\Aviral\Phase 2\Exploring Data\archive\titanic.csv\titanic.csv")      # Read the data

char_cabin = titanic_train["Cabin"].astype(str)    # Convert cabin to str

new_Cabin = np.array([cabin[0] for cabin in char_cabin]) # Take first letter

titanic_train["Cabin"] = pd.Categorical(new_Cabin)  # Save the new cabin var

In [3]:
my_tab=pd.crosstab(index = titanic_train['Survived'],
                   columns='count')
my_tab

col_0     count
Survived
0           549
1           342

In [4]:
titanic_train.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [5]:
# extract you the proportion of the data that belongs to a given category

In [6]:
#table of survival vs sex
survived_sex = pd.crosstab(index = titanic_train["Survived"],
                           columns = titanic_train['Sex'])
survived_sex.index = ["died",'survived']
survived_sex

Sex       female  male
died          81   468
survived     233   109

In [7]:
survived_sex/survived_sex.sum()

Sex         female      male
died      0.257962  0.811092
survived  0.742038  0.188908

In [9]:
#3d comaprision
surv_sex_class = pd.crosstab(index = titanic_train['Survived'],
                             columns= [titanic_train["Pclass"],
                                       titanic_train['Sex']],
                             margins=True)
surv_sex_class

Pclass        1           2           3       All
Sex      female male female male female male
Survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891